{
  "experience": [
    {
      "id": 1,
      "title": "Desarrollador Fullstack",
      "role": "Diseñar, desarrollar y mantener sistemas de gestión",
      "responsabilities": [
        "Desarrollo y mantenimiento de la interfaz de usuario del sistema, garantizando una experiencia óptima y fluida.",
        "Gestión e interacción con bases de datos MySQL, optimizando consultas y asegurando un rendimiento eficiente.",
        "Colaboración estrecha con el equipo de backend para la integración de API REST, asegurando una comunicación efectiva entre el frontend y el backend.",
        "Implementación de metodologías ágiles, particularmente SCRUM, para gestionar y priorizar tareas de manera eficiente.",
        "Uso de GIT para el control de versiones, facilitando la colaboración y el desarrollo continuo del software."
      ],
      "company": "Nucleo IT. Empresa de sistemas de gestión gastronómico.",
      "initialDate": "2022",
      "finalDate": "Presente",
      "tecnologies": [
        "Angular",
        "MySQL",
        "TypeScript",
        "Git",
        "C#",
        "Azure Devops"
      ]
    },
    {
      "id": 2,
      "title": "Desarrollador FullStack",
      "responsabilities": [
        "Diseño y desarrollo de un sistema de gestión personalizado para una escuela de danza, optimizando procesos administrativos.",
        "Automatización de la gestión de matrículas y seguimiento de estudiantes, mejorando la eficiencia operativa.",
        "Interacción con Firebase para la autenticación de usuarios y almacenamiento de datos, garantizando la seguridad y escalabilidad del sistema."
      ],
      "tecnologies": ["Angular", "Firebase", "TypeScript", "Git", "GitHub"],
      "company": "Freelance",
      "initialDate": "2024",
      "finalDate": "Presente"
    },
    {
      "id": 5,
      "title": "Desarrollador FullStack",
      "responsabilities": [
        "Desarrollo de un sistema de gestión interno para la administración de clientes de una empresa, mejorando la organización y el acceso a la información.",
        "Implementación del frontend utilizando React, Redux y Styled Components, garantizando una interfaz dinámica y fácil de usar.",
        "Creación de una API REST con Express en Node.js para la gestión de datos en el backend, asegurando una arquitectura robusta y escalable.",
        "Integración del sistema con una base de datos MongoDB, optimizando el almacenamiento y acceso a los datos."
      ],
      "tecnologies": [
        "React",
        "Redux",
        "Styled Components",
        "MongoDB",
        "TypeScript",
        "Node.js",
        "Git",
        "GitHub"
      ],
      "company": "Freelance",
      "initialDate": "2024",
      "finalDate": "Presente"
    },
    {
      "id": 3,
      "title": "Desarrollador Fullstack",
      "responsabilities": [
        "Desarrollo de una tarjeta de invitación interactiva para un evento de bodas, creando una experiencia única para los invitados.",
        "Integración de elementos multimedia en la tarjeta digital, mejorando la interacción y personalización de la invitación.",
        "Facilitación del proceso de confirmación de asistencia a través de la tarjeta digital, optimizando la gestión del evento."
      ],
      "tecnologies": [
        "React",
        "Redux",
        "Firebase",
        "TypeScript",
        "Git",
        "GitHub"
      ],
      "company": "Freelance",
      "initialDate": "2023",
      "finalDate": "2023"
    },
    {
      "id": 4,
      "title": "Desarrollador Fullstack",
      "responsabilities": [
        "Desarrollo de una plataforma de comercio electrónico en colaboración con una marca de ropa infantil, mejorando la experiencia de compra online.",
        "Creación de un sitio web intuitivo y seguro utilizando React y MongoDB, optimizando la navegación y las transacciones.",
        "Implementación de características clave para garantizar una experiencia de compra fluida y confiable para los usuarios."
      ],
      "tecnologies": [
        "React",
        "Redux",
        "Firebase",
        "TypeScript",
        "Git",
        "GitHub"
      ],
      "company": "Freelance",
      "initialDate": "2021",
      "finalDate": "2021"
    }
  ]
}
