{
  "experience": [
    {
      "id": 1,
      "title": "Desarrollador Frontend",
      "role": "Desarrollador y mantenedor del sistema de gestión",
      "responsabilities": [
        "Desarrollo y mantenimiento de la interfaz frontend del sistema.",
        "Gestión e interacción con bases de datos MySQL para asegurar un rendimiento óptimo.",
        "Colaboración con el equipo de backend para integrar API REST.",
        "Implementación de metodologías ágiles, específicamente SCRUM, para gestionar y priorizar tareas.",
        "Uso de GIT para el control de versiones y la colaboración en el desarrollo de software."
      ],
      "company": "Nucleo IT. Empresa de sistemas de gestión gastronómico.",
      "initialDate": "2022",
      "finalDate": "Presente",
      "tecnologies": ["Angular", "MySql", "Typscript", "Git"]
    },
    {
      "id": 2,
      "title": "Desarrollador FullStack",
      "responsabilities": [
        "Diseñé y desarrollé un sistema de gestión personalizado para una escuela de danza.",
        "Automatice procesos administrativos, gestionar matrículas y seguimiento de estudiantes.",
        "Interaccion con base de datos, Auth y storage de Firebase."
      ],
      "tecnologies": ["Angular", "Firebase", "Typscript", "Git", "Github"],
      "company": "Freelance",
      "initialDate": "2024",
      "finalDate": "Presente"
    },
    {
      "id": 5,
      "title": "Desarrollador FullStack",
      "responsabilities": [
        "Desarrollo de un sistema de gestión para el manejo de clientes de manera interna para una empresa.",
        "Uso de React, Redux y Styled Components para el frontend del sistema.",
        "Creación de una API REST con Express en Node.js para el backend.",
        "Conexión del sistema a una base de datos en MongoDB."
      ],
      "tecnologies": [
        "React",
        "Redux",
        "StyledComponents",
        "MongoDB",
        "Typscript",
        "Node.js",
        "Git",
        "Github"
      ],
      "company": "Freelance",
      "initialDate": "2024",
      "finalDate": "Presente"
    },
    {
      "id": 3,
      "title": "Desarrollador Fullstack",
      "responsabilities": [
        "Desarrollo de una tarjeta de invitación interactiva para un casamiento.",
        "Creación de una tarjeta digital que proporcionó una manera única y memorable de invitar a los invitados.",
        "Incorporación de elementos multimedia en la tarjeta de invitación.",
        "Facilitación de la confirmación de asistencia a través de la tarjeta digital."
      ],
      "tecnologies": [
        "React",
        "Redux",
        "Firebase",
        "Typscript",
        "Git",
        "Github"
      ],
      "company": "Freelance",
      "initialDate": "2023",
      "finalDate": "2023"
    },
    {
      "id": 4,
      "title": "Desarrollador Fullstack",
      "responsabilities": [
        "Desarrollo de un e-commerce en colaboración con una marca de ropa infantil utilizando React y MongoDB.",
        "Creación de una plataforma online intuitiva y segura para la venta de productos.",
        "Brindar una experiencia de compra óptima para los usuarios."
      ],
      "tecnologies": ["React, Redux, Firebase, Typscript", "Git", "Github"],
      "company": "Freelance",
      "initialDate": "2021",
      "finalDate": "2021"
    }
  ]
}
